// Создайте базовую структуру для персонажа из полей имени, уровня, опыта, класса
// Создайте структуру для хранения уникальных атрибутов Воина, Мага, Лучника с включением базовой структуры.
// Определите общие методы работы с персонажами в интерфейсе
// Реализуйте методы нанесения повреждений, воcстанновления здоровья, супер удара.
// Организуйте бой двух персонажей с нанесением удара и вычислением оставшегося здоровья. 
package main

type Warrior struct{
	
}

type Wizard struct{

}

type Archer struct{
	
}

type Herro struct{
	name string
	lvl int
	xp int
	hero_class struct
}

